import React, {Component} from 'react';
import EventGallery from "../Event/EventGallery";
import './AboutUs.css';
import SubmitImagesAboutUs from "./SubmitImagesAboutUs/SubmitImagesAboutUs";


export default class AboutUs extends Component {
    constructor(props) {
        super(props);
    }
    render() {
        var style = {
        };
        var h1Class = "f2-l f3-m f3 mb2 mt0 tc";
        var midcontainerClass = "flex flex-row";
        var containerClass = "w-100 mw-95 fl br2 bg-near-white shadow-2 pa2 ph4-l ph3 tj mt3 ml3";
        if (document.body.clientWidth > 786) {
            midcontainerClass = "flex flex-row";
            style={marginLeft: '3.33333%'}
        } else {
            midcontainerClass = "flex flex-column";
        }
        return (
            <div className={containerClass} style={style}>
                <h1 className={h1Class}>About us</h1>
                {this.props.isAdmin===true?<SubmitImagesAboutUs/>:null}
                <hr/>
                <div className={midcontainerClass}>
                    <img src={require("./../../images/logo.png")} className={"w-30-l w-auto of-contain"} alt="logo"/>
                    <p className={"w-70-l"}>“3х3 Мacedonia” е основанa како бренд-проект, од страна на
                        Здружението за популаризација и промоција
                        на кошарката 3х3 Basketball Скопје, кое фукционира под капата нa Светската Кошаркарска
                        Федерација
                        (FIBA) и Македонската Кошаркарска Федерација (МКФ). Основна цел на 3x3 Македонија е крирање
                        на план
                        и програм за развој на 3х3 баскетот во нашата земја, како и претставување на Република
                        Македонија на
                        меѓународните натпреварувања, кога е во прашање оваа дисциплина. Популарноста на 3х3
                        кошарката расте
                        од ден на ден. Наша цел е преку организирање на турнирите во Република Македонија да се
                        формира
                        квалитетен национален тим и учество на европската , светската и олимписката сцена. Сето ова
                        спаѓа
                        под слоганот „From the streets to the world stage“ - Од улица до светска сцена.
                        <br/>
                        <span className={"b"}>
                            Ве очекуваме!
                        </span>
                    </p>
                </div>
                <hr/>
                <p>Во прашање е игра која доста се разликува од класичната кошарка со самото тоа што
                    во 3х3 се користи
                    само еден кош за игра, шест играчи и динамична игра што на овој спорт му дава посебен шмек,
                    променети се и многу правила како овој спорт би го направиле што поатрактивен како за гледачите
                    така
                    и за самите натпреварувачи. Уште една работа што не издвојува од класичната кошарка, 3х3
                    кошарката
                    се игра на отворен простор и тоа на специјализиран ,мобилен терен каде најчесто се поставува на
                    атрактивни локации. Средината и концептот на турнирите најчесто има за цел поголема фрекфенција
                    на
                    луѓе и со самото тоа овој спорт е важен за самата средина каде турнирот се организира или за
                    спонзорите кои очекуваат маркетиншка корист од нашите настани. Целиот настан е пропратен со
                    музика (
                    со најпознати Хип Хоп Dj-и од регионот) во комбинација со познат спикер или водител кој
                    придонесува
                    поголема интеракција со публиката и овој настан го прави уште поатрактивен. Помеѓу натпреварите
                    на
                    турнирите има и ревијален дел каде се оддржуваат натпревари во шутирање на 3-ки, натпревар во
                    Забивање за натпреварувачите и ревијални натпревари на нашите партнери: Специјалната Олимпијада
                    на
                    Македонија , Познати кошаркарски имиња и многу други натпревари и награди за публиката.</p>
                <p>План за сезоната 2018 е формирање на првата 3х3 лига во Република Македонија која
                    ќе содржи 8-10
                    професионални баскет турнири. Секој турнир ќе биде организиран по најголемите FIBA 3х3 стандарди
                    што
                    подразбира: поставување на специфичен терен наменет исклучиво за 3х3 баскет и е одобрен од FIBA
                    ,
                    поставување на професионални кошаркарска конструкција, поставување на трибини за гледачите , VIP
                    ложа , DJ пулт, спонзорски катчиња , кафич , конференциски центар итн. 3х3 Macedonia досега има
                    организирано и учествуванo во организација на повеќе 3x3 FIBA endorsed турнири Skopje 2k17, 3x3
                    Gjorce Petrov 2018, 3X3 Центар 2018, 3x3 Skopje City Mall 2k18, Satellite Ohrid 2k18, Gevgelija
                    2k18, Probistip 2k18, Sveti Nikole 2k1 и на Bar SATELLITE 2k17, Црна Гора. Исто така
                    учествувавме на
                    европската недела на кошарката во организација на Специјалната Олимпијада на Македонија и ја
                    промовиравме 3х3 кошарката на претквалификацискиот кошаркарски натпревар помеѓу репрезентациите
                    на
                    Македонија и Словачка.
                </p>
                <hr/>
                <EventGallery whatfor={'aboutus'}/>
            </div>
        );
    }
}